tonyzhangnxp/micropython/ports/mimxrt/pyb_can.c
#if defined(CAN2)
void CAN2_IRQHandler(void) {
    pyb_can_handler(CAN2);
}
#endif

#if defined(CAN3)
void CAN3_IRQHandler(void) {
    pyb_can_handler(CAN3);
}
#endif

static void pyb_flexcan_deinit(pyb_can_obj_t *self) {
    if (MP_STATE_PORT(pyb_can_objects[self->can_id]) != NULL) {
        mp_uint_t instance = FLEXCAN_GetInstance(self->can_inst);
        DisableIRQ(((IRQn_Type [])CAN_Rx_Warning_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Tx_Warning_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Error_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Bus_Off_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_ORed_Message_buffer_IRQS)[instance]);
        FLEXCAN_DisableInterrupts(self->can_inst,
            kFLEXCAN_BusOffInterruptEnable | kFLEXCAN_ErrorInterruptEnable |
            kFLEXCAN_RxWarningInterruptEnable | kFLEXCAN_TxWarningInterruptEnable);
        FLEXCAN_DisableMbInterrupts(self->can_inst,
            kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
        MP_STATE_PORT(pyb_can_objects[self->can_id]) = NULL;
        self->is_enabled = false;
        FLEXCAN_Deinit(self->can_inst);
    }
}

STATIC void pyb_can_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->is_enabled) {
        mp_printf(print, "CAN(%u)", self->can_id);
    } else {
        qstr mode = MP_QSTR_NORMAL;
        if (self->flexcan_config->enableLoopBack) {
            if (self->flexcan_config->enableListenOnlyMode) {
                mode = MP_QSTR_SILENT_LOOPBACK;
            } else {
                mode = MP_QSTR_LOOPBACK;
            }
        } else if (self->flexcan_config->enableListenOnlyMode) {
            mode = MP_QSTR_SILENT;
        }
        mp_printf(print, "CAN(%u, mode=CAN.%q, auto_restart=%q, baudrate=%u)",
            self->can_id,
            mode,
            (self->can_inst->CTRL1 & CAN_CTRL1_BOFFREC_MASK) ? MP_QSTR_False : MP_QSTR_True,
            self->flexcan_config->bitRate);
    }
}

STATIC mp_obj_t pyb_can_init_helper(pyb_can_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_auto_restart, ARG_baudrate };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,         MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = CAN_NORMAL_MODE} },
        { MP_QSTR_auto_restart, MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_bool = false} },
        { MP_QSTR_baudrate,     MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0} },
    };

    // Parse the arguments.
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    pyb_flexcan_deinit(self);

    // Initialise the CAN peripheral.
    self->flexcan_config->enableLoopBack = args[ARG_mode].u_int & CAN_LOOPBACK_FLAG;
    self->flexcan_config->enableListenOnlyMode = args[ARG_mode].u_int & CAN_SILENT_FLAG;
    self->flexcan_config->bitRate = args[ARG_baudrate].u_int;

    // When selecting the CCM CAN clock source with CAN_CLK_SEL set to 2, the UART clock gate
    // will not open and CAN_CLK_ROOT will be off. To avoid this issue, set CAN_CLK_SEL to 0 or
    // 1 for CAN clock selection, or open the UART clock gate by configuring the CCM_CCGRx register.
    // There are two workarounds:
    // Set CAN_CLK_SEL to 0 or 1 for CAN clock selection, or if CAN_CLK_SEL is set to 2,
    // then the CCM must open any of UART clock gate by configuring the CCM_CCGRx register.
    #if (defined(FSL_FEATURE_CCM_HAS_ERRATA_50235) && FSL_FEATURE_CCM_HAS_ERRATA_50235)
    CLOCK_EnableClock(kCLOCK_Lpuart1);
    #endif // FSL_FEATURE_CCM_HAS_ERRATA_50235

    uint32_t sourceClock_Hz;
    #ifdef MIMXRT117x_SERIES
    sourceClock_Hz = can_clock_index_table[self->can_hw_id];
    #else
    sourceClock_Hz = BOARD_BOOTCLOCKRUN_CAN_CLK_ROOT;
    #endif

    FLEXCAN_Init(self->can_inst, self->flexcan_config, sourceClock_Hz);
    memset(self->flexcan_rx_fifo_config->idFilterTable, 0,
        sizeof(uint32_t) * self->flexcan_rx_fifo_config->idFilterNum);
    FLEXCAN_SetRxFifoConfig(self->can_inst, self->flexcan_rx_fifo_config, true);

    // Calculate the Number of Mailboxes occupied by RX Legacy FIFO and the filter.
    mp_uint_t rffn = (uint8_t)((self->can_inst->CTRL2 & CAN_CTRL2_RFFN_MASK) >> CAN_CTRL2_RFFN_SHIFT);
    self->flexcan_txmb_start = 6U + (rffn + 1U) * 2U;
    #if ((defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) || \
    (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829))
    // the first valid MB should be occupied by ERRATA 5461 or 5829.
    self->flexcan_txmb_start += 1U;
    #endif
    self->flexcan_txmb_count = self->flexcan_config->maxMbNum - self->flexcan_txmb_start;

    for (mp_uint_t i = 0; i < self->flexcan_txmb_count; i++) {
        FLEXCAN_SetTxMbConfig(self->can_inst, self->flexcan_txmb_start + i, true);
    }

    if (!args[ARG_auto_restart].u_bool) {
        self->can_inst->CTRL1 |= CAN_CTRL1_BOFFREC_MASK;
    } else {
        self->can_inst->CTRL1 &= ~CAN_CTRL1_BOFFREC_MASK;
    }

    self->callback = mp_const_none;
    self->is_enabled = true;
    self->num_error_warning = 0;
    self->num_error_passive = 0;
    self->num_bus_off = 0;

    MP_STATE_PORT(pyb_can_objects[self->can_id]) = self;

    FLEXCAN_EnableMbInterrupts(self->can_inst,
        kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);

    FLEXCAN_EnableInterrupts(self->can_inst,
        kFLEXCAN_BusOffInterruptEnable | kFLEXCAN_ErrorInterruptEnable |
        kFLEXCAN_RxWarningInterruptEnable | kFLEXCAN_TxWarningInterruptEnable);

    mp_uint_t instance = FLEXCAN_GetInstance(self->can_inst);
    EnableIRQ(((IRQn_Type [])CAN_Rx_Warning_IRQS)[instance]);
    EnableIRQ(((IRQn_Type [])CAN_Tx_Warning_IRQS)[instance]);
    EnableIRQ(((IRQn_Type [])CAN_Error_IRQS)[instance]);
    EnableIRQ(((IRQn_Type [])CAN_Bus_Off_IRQS)[instance]);
    EnableIRQ(((IRQn_Type [])CAN_ORed_Message_buffer_IRQS)[instance]);

