tonyzhangnxp/micropython/ports/mimxrt/pyb_can.c
    return MP_OBJ_FROM_PTR(self);
}

// CAN(bus, ...)
mp_obj_t pyb_can_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // Get the CAN bus id.
    int can_id = mp_obj_get_int(args[0]);
    if (can_id < 0 || can_id >= MP_ARRAY_SIZE(can_index_table) || can_index_table[can_id] == 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("CAN(%d) doesn't exist"), can_id);
    }

    // Get peripheral object.
    mp_uint_t can_hw_id = can_index_table[can_id];  // the hw can number 1..n
    pyb_can_obj_t *self = mp_obj_malloc(pyb_can_obj_t, &pyb_can_type);
    self->can_id = can_id;
    self->can_inst = can_base_ptr_table[can_hw_id];
    self->can_hw_id = can_hw_id;
    self->flexcan_config = m_new_obj(flexcan_config_t);
    FLEXCAN_GetDefaultConfig(self->flexcan_config);
    mp_uint_t maxMbNum = FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(self->can_inst);
    self->flexcan_config->maxMbNum = maxMbNum;
    self->flexcan_config->disableSelfReception = true;

    self->flexcan_rx_fifo_config = m_new_obj(flexcan_rx_fifo_config_t);
    mp_uint_t idFilterNum = maxMbNum * 2;
    self->flexcan_rx_fifo_config->idFilterNum = idFilterNum;
    self->flexcan_rx_fifo_config->idFilterType = kFLEXCAN_RxFifoFilterTypeA;
    self->flexcan_rx_fifo_config->priority = kFLEXCAN_RxFifoPrioHigh;
    self->flexcan_rx_fifo_config->idFilterTable = m_new0(uint32_t, idFilterNum);

    // Configure board-specific pin MUX based on the hardware device number.
    bool can_present = can_set_iomux(can_hw_id);

    if (can_present) {
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
        return pyb_can_init_helper(self, n_args - 1, args + 1, &kw_args);
    } else {
        return mp_const_none;
    }
}

// can.init(mode, [kwargs])
STATIC mp_obj_t pyb_can_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    return pyb_can_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
MP_DEFINE_CONST_FUN_OBJ_KW(pyb_can_init_obj, 1, pyb_can_init);

// deinit()
STATIC mp_obj_t pyb_can_deinit(mp_obj_t self_in) {
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    pyb_flexcan_deinit(self);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_can_deinit_obj, pyb_can_deinit);

// Force a software restart of the controller, to allow transmission after a bus error
STATIC mp_obj_t pyb_can_restart(mp_obj_t self_in) {
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->is_enabled) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN bus not enabled"));
    }
    bool boff_rec = self->can_inst->CTRL1 & CAN_CTRL1_BOFFREC_MASK;
    self->can_inst->CTRL1 &= ~CAN_CTRL1_BOFFREC_MASK;
    while (self->can_inst->CTRL1 & CAN_CTRL1_BOFFREC_MASK) {
    }
    if (boff_rec) {
        self->can_inst->CTRL1 |= CAN_CTRL1_BOFFREC_MASK;
        while ((self->can_inst->CTRL1 & CAN_CTRL1_BOFFREC_MASK) == 0) {
        }
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_can_restart_obj, pyb_can_restart);

// Get the state of the controller
STATIC mp_obj_t pyb_can_state(mp_obj_t self_in) {
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->is_enabled) {
        uint32_t result = FLEXCAN_GetStatusFlags(self->can_inst);
        uint32_t flt_conf = (result & CAN_ESR1_FLTCONF_MASK) >> CAN_ESR1_FLTCONF_SHIFT;
        if (flt_conf > 1) {
            return MP_OBJ_NEW_SMALL_INT(CAN_STATE_BUS_OFF);
        }
        if (flt_conf == 1) {
            return MP_OBJ_NEW_SMALL_INT(CAN_STATE_ERROR_PASSIVE);
        }
        if ((result & CAN_ESR1_RXWRN_MASK) || (result & CAN_ESR1_TXWRN_MASK)) {
            return MP_OBJ_NEW_SMALL_INT(CAN_STATE_ERROR_WARNING);
        }
        // flt_conf == 0
        return MP_OBJ_NEW_SMALL_INT(CAN_STATE_ERROR_ACTIVE);
    }
    return MP_OBJ_NEW_SMALL_INT(CAN_STATE_STOPPED);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_can_state_obj, pyb_can_state);

static mp_uint_t can_count_txmb_pending(pyb_can_obj_t *self) {
    mp_uint_t count = 0;
    for (mp_uint_t i = 0; i < self->flexcan_txmb_count; i++) {
        uint32_t cs_temp = self->can_inst->MB[self->flexcan_txmb_start + i].CS;
        if ((cs_temp & CAN_CS_CODE_MASK) == CAN_CS_CODE(kFLEXCAN_TxMbDataOrRemote)) {
            count++;
        }
    }
    return count;
}

// Get info about error states and TX/RX buffers
STATIC mp_obj_t pyb_can_info(size_t n_args, const mp_obj_t *args) {
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (!self->is_enabled) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN bus not enabled"));
    }
    mp_obj_list_t *list;
    if (n_args == 1) {
        list = MP_OBJ_TO_PTR(mp_obj_new_list(8, NULL));
    } else {
        if (!mp_obj_is_type(args[1], &mp_type_list)) {
            mp_raise_TypeError(NULL);
        }
        list = MP_OBJ_TO_PTR(args[1]);
        if (list->len < 8) {
            mp_raise_ValueError(NULL);
        }
    }

    CAN_Type *can = self->can_inst;
    list->items[0] = MP_OBJ_NEW_SMALL_INT((can->ECR & CAN_ECR_TXERRCNT_MASK) >> CAN_ECR_TXERRCNT_SHIFT);
    list->items[1] = MP_OBJ_NEW_SMALL_INT((can->ECR & CAN_ECR_RXERRCNT_MASK) >> CAN_ECR_RXERRCNT_SHIFT);
    list->items[2] = MP_OBJ_NEW_SMALL_INT(self->num_error_warning);
    list->items[3] = MP_OBJ_NEW_SMALL_INT(self->num_error_passive);
    list->items[4] = MP_OBJ_NEW_SMALL_INT(self->num_bus_off);
    list->items[5] = MP_OBJ_NEW_SMALL_INT(can_count_txmb_pending(self));
    // only 0 or 1
    int n_rx_pending = FLEXCAN_GetMbStatusFlags(can, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);
    list->items[6] = MP_OBJ_NEW_SMALL_INT(n_rx_pending);
    list->items[7] = MP_OBJ_NEW_SMALL_INT(0);

    return MP_OBJ_FROM_PTR(list);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(pyb_can_info_obj, 1, 2, pyb_can_info);

// any(fifo) - return `True` if any message waiting on the FIFO, else `False`
STATIC mp_obj_t pyb_can_any(mp_obj_t self_in, mp_obj_t fifo_in) {
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->is_enabled) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN bus not enabled"));
    }
    mp_int_t fifo = mp_obj_get_int(fifo_in);
    if (fifo != 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("Fifo must be 0"));
    }
    if (FLEXCAN_GetMbStatusFlags(self->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)) {
        return mp_const_true;
    }
    return mp_const_false;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(pyb_can_any_obj, pyb_can_any);

static mp_uint_t can_find_txmb(pyb_can_obj_t *self, flexcan_frame_t *frame) {
    // See if this frame id has been used before. If so, re-use the same mailbox to keep message ordering.
    for (mp_uint_t i = 0; i < self->flexcan_txmb_count; i++) {
        uint32_t cs_temp = self->can_inst->MB[self->flexcan_txmb_start + i].CS;
        if (((frame->format == kFLEXCAN_FrameFormatStandard) || (cs_temp & CAN_CS_IDE_MASK))
            && ((frame->type == kFLEXCAN_FrameTypeData) || (cs_temp & CAN_CS_RTR_MASK))
            && (self->can_inst->MB[self->flexcan_txmb_start + i].ID == frame->id)) {
            if ((cs_temp & CAN_CS_CODE_MASK) != CAN_CS_CODE(kFLEXCAN_TxMbDataOrRemote)) {
                return self->flexcan_txmb_start + i;
            } else {
                return 0;
            }
        }
    }
    // Frame id has never been used before so just pick the first empty mailbox.
    for (mp_uint_t i = 0; i < self->flexcan_txmb_count; i++) {
        uint32_t cs_temp = self->can_inst->MB[self->flexcan_txmb_start + i].CS;
        if ((cs_temp & CAN_CS_CODE_MASK) != CAN_CS_CODE(kFLEXCAN_TxMbDataOrRemote)) {
            return self->flexcan_txmb_start + i;
        }
    }
    return 0;
}

