tonyzhangnxp/micropython/ports/mimxrt/pyb_can.c
STATIC mp_obj_t pyb_can_send(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_data, ARG_id, ARG_timeout, ARG_rtr, ARG_extframe };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_data,     MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_id,       MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = 0} },
        { MP_QSTR_timeout,  MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0} },
        { MP_QSTR_rtr,      MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_bool = false} },
        { MP_QSTR_extframe, MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_bool = false} },
    };

    // parse args
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    if (!self->is_enabled) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN bus not enabled"));
    }
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // get the buffer to send from
    mp_buffer_info_t bufinfo;
    uint8_t data[1];
    if (mp_obj_is_int(args[ARG_data].u_obj)) {
        data[0] = mp_obj_get_int(args[ARG_data].u_obj);
        bufinfo.buf = data;
        bufinfo.len = 1;
        bufinfo.typecode = 'B';
    } else {
        mp_get_buffer_raise(args[ARG_data].u_obj, &bufinfo, MP_BUFFER_READ);
    }

    if (bufinfo.len > CAN_MAX_DATA_FRAME) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN data field too long"));
    }

    flexcan_frame_t tx_msg;

    tx_msg.dataWord0 = 0;
    tx_msg.dataWord1 = 0;

    if (bufinfo.len > 0) {
        tx_msg.dataByte0 = ((byte *)bufinfo.buf)[0];
    }
    if (bufinfo.len > 1) {
        tx_msg.dataByte1 = ((byte *)bufinfo.buf)[1];
    }
    if (bufinfo.len > 2) {
        tx_msg.dataByte2 = ((byte *)bufinfo.buf)[2];
    }
    if (bufinfo.len > 3) {
        tx_msg.dataByte3 = ((byte *)bufinfo.buf)[3];
    }
    if (bufinfo.len > 4) {
        tx_msg.dataByte4 = ((byte *)bufinfo.buf)[4];
    }
    if (bufinfo.len > 5) {
        tx_msg.dataByte5 = ((byte *)bufinfo.buf)[5];
    }
    if (bufinfo.len > 6) {
        tx_msg.dataByte6 = ((byte *)bufinfo.buf)[6];
    }
    if (bufinfo.len > 7) {
        tx_msg.dataByte7 = ((byte *)bufinfo.buf)[7];
    }

    tx_msg.length = bufinfo.len;
    tx_msg.type = args[ARG_rtr].u_bool;
    tx_msg.format = args[ARG_extframe].u_bool;

    if (tx_msg.format) {
        tx_msg.id = FLEXCAN_ID_EXT(args[ARG_id].u_int);
    } else {
        tx_msg.id = FLEXCAN_ID_STD(args[ARG_id].u_int);
    }

    uint32_t timeout_ms = args[ARG_timeout].u_int;
    uint32_t start = mp_hal_ticks_ms();

    while (true) {
        mp_uint_t mbIdx = can_find_txmb(self, &tx_msg);
        if (mbIdx && (FLEXCAN_WriteTxMb(self->can_inst, mbIdx, &tx_msg) == kStatus_Success)) {
            break;
        }
        if (timeout_ms == 0) {
            mp_raise_OSError(MP_ETIMEDOUT);
        }
        // Check for the Timeout
        if (timeout_ms != UINT32_MAX) {
            if (mp_hal_ticks_ms() - start >= timeout_ms) {
                mp_raise_OSError(MP_ETIMEDOUT);
            }
        }
        MICROPY_EVENT_POLL_HOOK
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_can_send_obj, 1, pyb_can_send);

// recv(fifo, list=None, *, timeout=5000)
STATIC mp_obj_t pyb_can_recv(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_fifo, ARG_list, ARG_timeout, ARG_fdf };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_fifo,    MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_list,    MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 5000} },
    };

    // parse args
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    if (!self->is_enabled) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN bus not enabled"));
    }
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_uint_t fifo = args[ARG_fifo].u_int;
    if (fifo != 0) {
        mp_raise_TypeError(MP_ERROR_TEXT("fifo must be 0"));
    }

    uint32_t timeout_ms = args[ARG_timeout].u_int;
    uint32_t start = mp_hal_ticks_ms();

    while (!FLEXCAN_GetMbStatusFlags(self->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)) {
        if (timeout_ms == 0) {
            mp_raise_OSError(MP_ETIMEDOUT);
        }
        // Check for the Timeout
        if (timeout_ms != UINT32_MAX) {
            if (mp_hal_ticks_ms() - start >= timeout_ms) {
                mp_raise_OSError(MP_ETIMEDOUT);
            }
        }
        MICROPY_EVENT_POLL_HOOK
    }

    flexcan_frame_t rx_frame;
    status_t status = FLEXCAN_ReadRxFifo(self->can_inst, &rx_frame);
    FLEXCAN_ClearMbStatusFlags(self->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);

    FLEXCAN_EnableMbInterrupts(self->can_inst,
        kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);

    if (status != kStatus_Success) {
        mp_raise_OSError(MP_EIO);
    }

    uint32_t rx_dlc = rx_frame.length;
    uint8_t rx_data[CAN_MAX_DATA_FRAME] = {};

    if (rx_dlc > 0) {
        rx_data[0] = rx_frame.dataByte0;
    }
    if (rx_dlc > 1) {
        rx_data[1] = rx_frame.dataByte1;
    }
    if (rx_dlc > 2) {
        rx_data[2] = rx_frame.dataByte2;
    }
    if (rx_dlc > 3) {
        rx_data[3] = rx_frame.dataByte3;
    }
    if (rx_dlc > 4) {
        rx_data[4] = rx_frame.dataByte4;
    }
    if (rx_dlc > 5) {
        rx_data[5] = rx_frame.dataByte5;
    }
    if (rx_dlc > 6) {
        rx_data[6] = rx_frame.dataByte6;
    }
    if (rx_dlc > 7) {
        rx_data[7] = rx_frame.dataByte7;
    }

    // Create the tuple, or get the list, that will hold the return values
    // Also populate the fifth element, either a new bytes or reuse existing memoryview
    mp_obj_t ret_obj = args[ARG_list].u_obj;
    mp_obj_t *items;
    if (ret_obj == mp_const_none) {
        ret_obj = mp_obj_new_tuple(5, NULL);
        items = ((mp_obj_tuple_t *)MP_OBJ_TO_PTR(ret_obj))->items;
        items[4] = mp_obj_new_bytes(rx_data, rx_dlc);
    } else {
        // User should provide a list of length at least 5 to hold the values
        if (!mp_obj_is_type(ret_obj, &mp_type_list)) {
            mp_raise_TypeError(NULL);
        }
        mp_obj_list_t *list = MP_OBJ_TO_PTR(ret_obj);
        if (list->len < 5) {
            mp_raise_ValueError(NULL);
        }
        items = list->items;
        // Fifth element must be a memoryview which we assume points to a
        // byte-like array which is large enough, and then we resize it inplace
        if (!mp_obj_is_type(items[4], &mp_type_memoryview)) {
            mp_raise_TypeError(NULL);
        }
        mp_obj_array_t *mv = MP_OBJ_TO_PTR(items[4]);
        if (!(mv->typecode == (MP_OBJ_ARRAY_TYPECODE_FLAG_RW | BYTEARRAY_TYPECODE)
              || (mv->typecode | 0x20) == (MP_OBJ_ARRAY_TYPECODE_FLAG_RW | 'b'))) {
            mp_raise_ValueError(NULL);
        }
        mv->len = rx_dlc;
        memcpy(mv->items, rx_data, rx_dlc);
    }

    // Populate the first 4 values of the tuple/list
    items[0] = MP_OBJ_NEW_SMALL_INT(rx_frame.id >> (rx_frame.format ? CAN_ID_EXT_SHIFT : CAN_ID_STD_SHIFT));
    items[1] = mp_obj_new_bool(rx_frame.format);
    items[2] = mp_obj_new_bool(rx_frame.type);
    items[3] = MP_OBJ_NEW_SMALL_INT(rx_frame.idhit);

    // Return the result
    return ret_obj;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_can_recv_obj, 1, pyb_can_recv);

