tonyzhangnxp/micropython/ports/mimxrt/pyb_can.c
STATIC mp_obj_t pyb_can_clearfilter(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_extframe };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_extframe, MP_ARG_BOOL, {.u_bool = false} },
    };

    // parse args
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    if (!self->is_enabled) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN bus not enabled"));
    }
    mp_uint_t bank = mp_obj_get_int(pos_args[1]);
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 2, pos_args + 2, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if ((bank < 0) || (bank >= self->flexcan_config->maxMbNum)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("%d maximum banks"),
            self->flexcan_config->maxMbNum);
    }

    self->flexcan_rx_fifo_config->idFilterTable[bank * 2] = 0;
    self->flexcan_rx_fifo_config->idFilterTable[(bank * 2) + 1] = 0;

    FLEXCAN_SetRxFifoConfig(self->can_inst, self->flexcan_rx_fifo_config, true);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_can_clearfilter_obj, 2, pyb_can_clearfilter);

// setfilter(bank, mode, fifo, params, *, rtr)
STATIC mp_obj_t pyb_can_setfilter(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_bank, ARG_mode, ARG_fifo, ARG_params, ARG_rtr, ARG_extframe };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_bank,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_mode,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_fifo,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_params,   MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_rtr,      MP_ARG_KW_ONLY | MP_ARG_OBJ,  {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_extframe, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
    };

    // parse args
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    if (!self->is_enabled) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN bus not enabled"));
    }
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_uint_t bank = args[ARG_bank].u_int;
    if ((bank < 0) || (bank >= self->flexcan_config->maxMbNum)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("%d maximum banks"),
            self->flexcan_config->maxMbNum);
    }

    if (args[ARG_fifo].u_int != 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("fifo must be 0"));
    }

    size_t len;
    size_t rtr_len;
    mp_uint_t rtr_masks[2] = {0, 0};
    mp_obj_t *rtr_flags;
    mp_obj_t *params;
    mp_obj_get_array(args[ARG_params].u_obj, &len, &params);
    if (args[ARG_rtr].u_obj != MP_OBJ_NULL) {
        mp_obj_get_array(args[ARG_rtr].u_obj, &rtr_len, &rtr_flags);
    }

    if (args[ARG_mode].u_int == CAN_DUAL) {
        if (len != 2) {
            goto error;
        }
        if (args[ARG_rtr].u_obj != MP_OBJ_NULL) {
            if (rtr_len != 2) {
                goto error;
            }
            rtr_masks[0] = mp_obj_is_true(rtr_flags[0]);
            rtr_masks[1] = mp_obj_is_true(rtr_flags[1]);
        }
        mp_uint_t id0 = mp_obj_get_int(params[0]);
        mp_uint_t id1 = mp_obj_get_int(params[1]);
        if (args[ARG_extframe].u_bool) {
            id0 = FLEXCAN_ID_EXT(id0) | (1 << 29);
            id1 = FLEXCAN_ID_EXT(id1) | (1 << 29);
        } else {
            id0 = FLEXCAN_ID_STD(id0);
            id1 = FLEXCAN_ID_STD(id1);
        }
        id0 = ((rtr_masks[0] << 30) | id0) << 1;
        id1 = ((rtr_masks[1] << 30) | id1) << 1;
        self->flexcan_rx_fifo_config->idFilterTable[bank * 2] = id0;
        self->flexcan_rx_fifo_config->idFilterTable[(bank * 2) + 1] = id1;
    } else {
        goto error;
    }

    FLEXCAN_SetRxFifoConfig(self->can_inst, self->flexcan_rx_fifo_config, true);

    return mp_const_none;
error:
    mp_raise_ValueError(MP_ERROR_TEXT("CAN filter parameter error"));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_can_setfilter_obj, 1, pyb_can_setfilter);

STATIC mp_obj_t pyb_can_rxcallback(mp_obj_t self_in, mp_obj_t fifo_in, mp_obj_t callback_in) {
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->is_enabled) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN bus not enabled"));
    }
    mp_int_t fifo = mp_obj_get_int(fifo_in);
    if (fifo != 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("fifo must be 0"));
    }
    self->callback = callback_in;
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(pyb_can_rxcallback_obj, pyb_can_rxcallback);

STATIC const mp_rom_map_elem_t pyb_can_locals_dict_table[] = {
    // instance methods
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&pyb_can_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&pyb_can_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_restart), MP_ROM_PTR(&pyb_can_restart_obj) },
    { MP_ROM_QSTR(MP_QSTR_state), MP_ROM_PTR(&pyb_can_state_obj) },
    { MP_ROM_QSTR(MP_QSTR_info), MP_ROM_PTR(&pyb_can_info_obj) },
    { MP_ROM_QSTR(MP_QSTR_any), MP_ROM_PTR(&pyb_can_any_obj) },
    { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&pyb_can_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_recv), MP_ROM_PTR(&pyb_can_recv_obj) },
    { MP_ROM_QSTR(MP_QSTR_setfilter), MP_ROM_PTR(&pyb_can_setfilter_obj) },
    { MP_ROM_QSTR(MP_QSTR_clearfilter), MP_ROM_PTR(&pyb_can_clearfilter_obj) },
    { MP_ROM_QSTR(MP_QSTR_rxcallback), MP_ROM_PTR(&pyb_can_rxcallback_obj) },

    // class constants
    { MP_ROM_QSTR(MP_QSTR_NORMAL), MP_ROM_INT(CAN_NORMAL_MODE) },
    { MP_ROM_QSTR(MP_QSTR_LOOPBACK), MP_ROM_INT(CAN_LOOPBACK_FLAG) },
    { MP_ROM_QSTR(MP_QSTR_SILENT), MP_ROM_INT(CAN_SILENT_FLAG) },
    { MP_ROM_QSTR(MP_QSTR_SILENT_LOOPBACK), MP_ROM_INT(CAN_LOOPBACK_FLAG | CAN_SILENT_FLAG) },
    { MP_ROM_QSTR(MP_QSTR_DUAL), MP_ROM_INT(CAN_DUAL) },
    { MP_ROM_QSTR(MP_QSTR_LIST32), MP_ROM_INT(CAN_DUAL) },

    // values for CAN.state()
    { MP_ROM_QSTR(MP_QSTR_STOPPED), MP_ROM_INT(CAN_STATE_STOPPED) },
    { MP_ROM_QSTR(MP_QSTR_ERROR_ACTIVE), MP_ROM_INT(CAN_STATE_ERROR_ACTIVE) },
    { MP_ROM_QSTR(MP_QSTR_ERROR_WARNING), MP_ROM_INT(CAN_STATE_ERROR_WARNING) },
    { MP_ROM_QSTR(MP_QSTR_ERROR_PASSIVE), MP_ROM_INT(CAN_STATE_ERROR_PASSIVE) },
    { MP_ROM_QSTR(MP_QSTR_BUS_OFF), MP_ROM_INT(CAN_STATE_BUS_OFF) },
};
