tonyzhangnxp/micropython/ports/mimxrt/pyb_can.c
STATIC MP_DEFINE_CONST_DICT(pyb_can_locals_dict, pyb_can_locals_dict_table);

STATIC mp_uint_t can_ioctl(mp_obj_t self_in, mp_uint_t request, uintptr_t arg, int *errcode) {
    pyb_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_uint_t ret;
    if (self->is_enabled && request == MP_STREAM_POLL) {
        uintptr_t flags = arg;
        ret = 0;

        if ((flags & MP_STREAM_POLL_RD)
            && FLEXCAN_GetMbStatusFlags(self->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)) {
            ret |= MP_STREAM_POLL_RD;
        }

        if ((flags & MP_STREAM_POLL_WR)
            && can_count_txmb_pending(self)) {
            ret |= MP_STREAM_POLL_WR;
        }
    } else {
        *errcode = MP_EINVAL;
        ret = -1;
    }
    return ret;
}

STATIC const mp_stream_p_t can_stream_p = {
    .ioctl = can_ioctl,
    .is_text = false,
};

MP_DEFINE_CONST_OBJ_TYPE(
    pyb_can_type,
    MP_QSTR_CAN,
    MP_TYPE_FLAG_NONE,
    make_new, pyb_can_make_new,
    print, pyb_can_print,
    protocol, &can_stream_p,
    locals_dict, &pyb_can_locals_dict
    );

MP_REGISTER_ROOT_POINTER(void *pyb_can_objects[MICROPY_HW_NUM_CAN_IRQS]);


static void machine_flexcan_deinit(pyb_can_obj_t *self) {
    if (MP_STATE_PORT(pyb_can_objects[self->can_id]) != NULL) {
        mp_uint_t instance = FLEXCAN_GetInstance(self->can_inst);
        DisableIRQ(((IRQn_Type [])CAN_Rx_Warning_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Tx_Warning_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Error_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Bus_Off_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_ORed_Message_buffer_IRQS)[instance]);
        FLEXCAN_DisableInterrupts(self->can_inst,
            kFLEXCAN_BusOffInterruptEnable | kFLEXCAN_ErrorInterruptEnable |
            kFLEXCAN_RxWarningInterruptEnable | kFLEXCAN_TxWarningInterruptEnable);
        FLEXCAN_DisableMbInterrupts(self->can_inst,
            kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
        MP_STATE_PORT(pyb_can_objects[self->can_id]) = NULL;
        self->is_enabled = false;
        FLEXCAN_Deinit(self->can_inst);
    }
}

// Deinit all can IRQ handlers.
void machine_can_irq_deinit(void) {
    for (int i = 0; i < MICROPY_HW_NUM_CAN_IRQS; ++i) {
        pyb_can_obj_t *pyb_can_obj = MP_STATE_PORT(pyb_can_objects[i]);
        if (pyb_can_obj != NULL) {
            machine_flexcan_deinit(pyb_can_obj);
        }
    }
}

#endif // MICROPY_HW_ENABLE_CAN
